INSERT INTO t_train (
    id, train_number, start_station, end_station, departure_time, arrival_time, sale_status
) VALUES (
             1, 'G1001', '北京南', '宁波', '2026-06-01 08:00:00', '2026-06-01 14:00:00', 0
         );

INSERT INTO t_train_station (
    train_id, station_name, sequence_no, arrival_time, departure_time
) VALUES
      (1, '北京南', 1, NULL, '2026-06-01 08:00:00'),
      (1, '济南西', 2, '2026-06-01 09:30:00', '2026-06-01 09:35:00'),
      (1, '南京南', 3, '2026-06-01 11:10:00', '2026-06-01 11:15:00'),
      (1, '杭州东', 4, '2026-06-01 12:40:00', '2026-06-01 12:45:00'),
      (1, '宁波',   5, '2026-06-01 14:00:00', NULL);



INSERT INTO t_seat (
    train_id, carriage_number, seat_number, seat_type,
    start_station, end_station, start_sequence, end_sequence,
    price, seat_status
) VALUES
-- 01A
(1, '01', '01A', 1, '北京南', '济南西', 1, 2, 10000, 0),
(1, '01', '01A', 1, '济南西', '南京南', 2, 3, 15000, 0),
(1, '01', '01A', 1, '南京南', '杭州东', 3, 4, 12000, 0),
(1, '01', '01A', 1, '杭州东', '宁波',   4, 5, 8000,  0),

-- 01B
(1, '01', '01B', 1, '北京南', '济南西', 1, 2, 10000, 0),
(1, '01', '01B', 1, '济南西', '南京南', 2, 3, 15000, 0),
(1, '01', '01B', 1, '南京南', '杭州东', 3, 4, 12000, 0),
(1, '01', '01B', 1, '杭州东', '宁波',   4, 5, 8000,  0),

-- 01C
(1, '01', '01C', 1, '北京南', '济南西', 1, 2, 10000, 0),
(1, '01', '01C', 1, '济南西', '南京南', 2, 3, 15000, 0),
(1, '01', '01C', 1, '南京南', '杭州东', 3, 4, 12000, 0),
(1, '01', '01C', 1, '杭州东', '宁波',   4, 5, 8000,  0);